УчетВУправляющихДляГит1/src/Enums/ВидыЗанятости/ВидыЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятости</name>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
  <enumValues>
    <name>Подработка</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/CommonModules/КадровыйУчетБазовыйКлиентСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ФормированиеПредставленийЭлементовСправочникаСотрудники

Функция ПредставлениеЭлементаСправочникаСотрудники(ДанныеДляФормированияПредставления) Экспорт
	
	Фамилия = Неопределено;
	ДанныеДляФормированияПредставления.Свойство("Фамилия", Фамилия);
	
	Имя = Неопределено;
	ДанныеДляФормированияПредставления.Свойство("Имя", Имя);
	
	Отчество = Неопределено;
	ДанныеДляФормированияПредставления.Свойство("Отчество", Отчество);
	
	УточнениеНаименованияФизическогоЛица = Неопределено;
	ДанныеДляФормированияПредставления.Свойство("УточнениеНаименованияФизическогоЛица", УточнениеНаименованияФизическогоЛица);
	
	УточнениеНаименованияСотрудника = Неопределено;
	ДанныеДляФормированияПредставления.Свойство("УточнениеНаименованияСотрудника", УточнениеНаименованияСотрудника);
	
	Возврат КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
		Фамилия, Имя, Отчество, УточнениеНаименованияФизическогоЛица, УточнениеНаименованияСотрудника);
	
КонецФункции

#КонецОбласти

Процедура ОбработкаПолученияДанныхВыбораВидовЗанятости(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Если НЕ Параметры.Отбор.Свойство("Ссылка") Тогда
		
		МассивДоступныхСсылок = Новый Массив;
		МассивДоступныхСсылок.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ОсновноеМестоРаботы"));
		МассивДоступныхСсылок.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Совместительство"));
		МассивДоступныхСсылок.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ВнутреннееСовместительство"));
		
		Параметры.Отбор.Вставить("Ссылка", МассивДоступныхСсылок);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
